package com.example.acceuil;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.widget.ExpandableListAdapter;
import android.widget.ExpandableListView;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;

public class i5 extends AppCompatActivity {
    private ExpandableListAdapter listAdapter;
    private ExpandableListView listView;
    private List<String> ListDataHeader;
    private HashMap<String, List<String>> ListDataChild;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_i5);
        listView =(ExpandableListView)findViewById(R.id.IvExp);
        initData();//create function to initiate data
        listAdapter = new ExpAdapter(this,ListDataHeader,ListDataChild);
        listView.setAdapter(listAdapter);
    }
    private void initData() {
        ListDataHeader = new ArrayList<>();
        ListDataChild = new HashMap<>();
        ListDataHeader.add(" الأخطاء الشائعة في السعى");
        ListDataHeader.add("أدعية المنسك");
        ListDataHeader.add(" شرح المنسك");


        List <String> exelem1= new ArrayList<>();
        exelem1.add( "رفع اليدين عند صعود الصفا والمروة كرفعهما في الصلاة، والسنة أن يرفع يديه كهيئة الداعي ويحمد الله ويكبره ويدعو   مستقبلاً القبلة. ");
        exelem1.add( "الإسراع في السعي بين الصفا والمروة في كل الشوط، وهو خطأ، والسنة الإسراع بين العلمين الأخضرين، والمشي في بقية الشوط. ");
        exelem1.add( "إسراع النساء في السعي بين العلمين، وهو خلاف السنة، والإسراع إنما هو خاص بالرجال دون  النساء. ");
        exelem1.add("قراءة قوله تعالى:{ إن الصفا والمروة من شعائر الله } ( البقرة: 158 ) في كل شوط كلما أقبل على الصفا والمروة، والسنة قراءتها عند بداية السعي، إذا دنا من الصفا  كما ثبت عن النبي صلى الله  عليه وسلم. ");
        exelem1.add("اعتقاد البعض أن الشوط يبتدئ من الصفا وينتهي بالصفا، فيعد هذا شوطا واحدا، والصواب أن   السعي من الصفا إلى المروة يعد  شوطاً كاملا، والسعي من المروة إلى الصفا يعد شوطاً آخر. ");
        exelem1.add("تخصيص كل شوط بدعاء معين، ولم يَرِدْ عن النبي صلى الله عليه وسلم دعاء خاص بكل شوطٍ، إلا  ما كان يدعو به على الصفا وعلى  المروة ");
        exelem1.add("من الخطأ التطوع بالسعي بين الصفا والمروة من غير أن يكون في حج أو عمرة، والسنة جاءت  باستحباب التطوع بالطواف بالبيت   فحسب. ");
        exelem1.add("توجه إلى المسعى لتسع سبعة أشواط بين الصفا والمروة والسنة عند قربك من الصفا في بداية الشوط الأول أن تقرأ قوله تعالـى :\n  (إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوْ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ   أَنْ يَطَّوَّفَ بِهِمَا وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ)  ثم تقول بعدها:  (نبدأ بما بدأ الله به )  ولا تقل هذا إلا في بداية الشوط الأول من السعي .\n");

        List <String> exelem2= new ArrayList<>();
        exelem2.add("يسن لك أن تصعد على الصفا و تستقبل القبلة على الصفا، وتحمد الله وتكبره، وتقول: \"الله أكبر الله أكبر الله أكبر.لا إله إلا الله وحده لا شريك له، له الملك و له الحمد، يحيي و يميت، و هو على كل شيء قدير، لا إله إلا الله وحده لا شريك له، أنجز وعده، و نصر عبده، و هزم الأحزاب وحده\"  ثم تدعو بما تيسر، رافعاً يديك. ");
        exelem2.add("ثم تقول هذا الذكر مرة ثالثة: ولا تقف للدعاء بل ابدأ سعيك إلـى المروة.");
        exelem2.add(" فإذا وصلت بين العلمين الأخضرين فالسنة أن تُسرع في المشي وتهرول دون مضايقة لأحد أو أذى للساعين ،هذا بالنسبة للرجل، أما المرأة فلا تسرع بين العلمين بل تمشي مشيتها المعتادة، فإذا جاوزت المسافة بين العلمين الأخضرين ، فامش مشيًا عاديًا حتى تصل إلى المروة فتكون قد أنهيت الشوط الأول من السعي.");
        exelem2.add("وفي أثناء السعي عليك بذكر الله والدعاء، ولا يوجد دعاء خاص بكل شوط من أشواط السعي.");
        exelem2.add("وفي أثناء السعي عليك بذكر الله والدعاء، ولا يوجد دعاء خاص بكل شوط من أشواط السعي.");
        exelem2.add("إذا وصلت إلى المروة فقف مستقبلاً القبلة وافعل مثل ما فعلت على الصفا، فترفع يديك كما ترفعها عند الدعاء وتقول: \"الله أكبر الله أكبر الله أكبر.لا إله إلا الله وحده لا شريك له، له الملك و له الحمد، يحيي و يميت، و هو على كل شيء  قدير، لا إله إلا الله وحده لا شريك له، أنجز وعده، و نصر عبده، و هزم الأحزاب وحده\" . ثم تدعو بما تيسر، رافعاً يديك.  وتكرر هذا الذكر والدعاء. ");
        List <String> exelem3= new ArrayList<>();
        exelem3.add( "ِنَّ الصَّفَا وَالمَرْوَةَ مِنْ شَعَائِرِ اللَّه \"لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ   وَلَهُ الْحَمْدُ وَهُوَ عَلَى  كُلِّ شَيْءٍ قَدِيرٌ، لَا إِلَهَ إِلَّا اللهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ\" ");
        exelem3.add( "\"اللَّهُمَّ اعْصِمْنَا بِدِينِكَ، وَطَوَاعِيَتِكَ، وَطَوَاعِيَةِ   رَسُولِكَ، وَجَنِّبْنَا حُدُودَكَ\".  ");
        exelem3.add( "اللَّهُمَّ اجْعَلْنَا نُحِبُّكَ، وَنُحِبُّ مَلَائِكَتَكَ، وَأَنْبِيَاءَكَ، وَرُسَلَكَ، وَنُحِبُّ   عِبَادَكَ الصَّالِحِينَ\". ");
        exelem3.add( "\"اللَّهُمَّ حَبِّبْنَا إِلَيْكَ وَإِلَى مَلَائِكَتِكَ، وَإِلَى أَنْبِيَائِكَ، وَرُسُلِكَ، وَإِلَى أَنْبِيَائِكَ، وَرُسُلِكَ، وَإِلَى عِبَادِكَ الصَّالِحِينَ\". ");
        exelem3.add( "\"اللَّهُمَّ يَسِّرْنَا لِلْيُسْرَى، وَجَنِّبْنَا وَجَنِّبْنَا   الْعُسْرَى، وَاغْفِرْ لَنَا فِي  الْآخِرَةِ\".");
        exelem3.add( "\"رَبِّ اغْفِرْ وَارْحَمْ إِنَّكَ أَنْتَ الْأَعَزُّ الْأَكْرَمُ\". ");




        ListDataChild.put(ListDataHeader.get(0),exelem1);
        ListDataChild.put(ListDataHeader.get(1),exelem2);
        ListDataChild.put(ListDataHeader.get(2),exelem3);


    }
}
